{"course_code": "SA302", "total_reviews": 5, "instructors": [{"professor_id": "118788", "professor_name": "John Bogardus", "avg_rating": 3.5, "avg_difficulty": 4.0, "review_count": 5, "reviews": [{"rating": 4.0, "difficulty": 3.0, "course_code": "SA302", "date": "Apr 19th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Interesting lecturer. Willing to listen to people's opinions even if they differ from his. Learnt a lot in his class. Different way of marking with his critique factor. But is there if you need advise. A lot of reading involved. Class is constructed well. Overall a good prof.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 4.0, "course_code": "SA302", "date": "Oct 27th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Critical summaries are only going to marked well if you dont include criticism, just focus on specifically what he details and outlines - thats all. Heavy reading and not well focused - this should be 2 courses. Pleasant man, but dont let that fool you into thinking you have creative wiggle room, especially if your views diverge in any way", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "SA302", "date": "Dec 11th, 2010", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "This class has sooooooo much reading and writing. Lectures are really long and boring. He is an okay professor, and the course content is tediously boring. DON'T Take this classs! Please!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 4.0, "course_code": "SA302", "date": "Apr 14th, 2008", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "John is the best prof I've ever had. His course was a life changing experience. Interesting, lively, fun, intelligent teacher. Lots of readings, and you can't be flaky on assignments. If you actually try, and you're smart, you'll get an A. Those who criticize him were probably lazy, and didn't really engage with the material in a meaningful way.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 4.0, "course_code": "SA302", "date": "Aug 12th, 2005", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "Bogardus was an overall good prof.. he really tries to communicate the material to the students.  the content of this course was interesting as well and he offers videos to help you understand the textbook from different perspectives.  he expects a lot in the assignments.  but all you have to do is try and im sure you'll do fine!", "helpful": 0, "not_helpful": 0, "tags": []}]}]}