{"course_code": "BUS361", "total_reviews": 4, "instructors": [{"professor_id": "1303982", "professor_name": "Kamal Masari", "avg_rating": 3.75, "avg_difficulty": 4.25, "review_count": 4, "reviews": [{"rating": 2.0, "difficulty": 5.0, "course_code": "BUS361", "date": "Apr 29th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "CLass BORING! He tells you baby stuff that you already know since high school! Need to study textbook for exam! ALL MEMORIZATION! Don't expect him to test you on understanding! He even change exam to short answer after he said in class that it would be all MC, just 2 days before exam, and saying that you are all excellent in studying.! R U Kidding?", "helpful": 0, "not_helpful": 1, "tags": []}, {"rating": 3.0, "difficulty": 5.0, "course_code": "BUS361", "date": "Apr 29th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I regret this taking course with him, exams are hard, highest mark was only 66/85, you need to do a project, there is weekly project assignment (time consuming everyweek), he gives very LOW mark, and the project assignment was for \"effort\" only, no marks given. Class attendance is mandatory, and you MUST participate A LOT to get a B, NOT HIM AGAIN!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 3.0, "course_code": "BUS361", "date": "Jan 4th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Most valuable and practical course ever taken in SFU. You will be able to plan and execute an event, which might be one of your best SFU experiences! The prof was very helpful and funny! Take BUS 361 with him!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 4.0, "course_code": "BUS361", "date": "Dec 22nd, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Fantastic prof. Very knowledgeable, provides practical experience, and keeps class funny. Must read the book for quizzes, but other than that not too bad. Exams are fair leaning towards hard but if you UNDERSTAND the material you'll do well. Hard professors that actually teach you are the most valuable! And talk in class, participation is important", "helpful": 0, "not_helpful": 0, "tags": []}]}]}