{"course_code": "EDUC879", "total_reviews": 4, "instructors": [{"professor_id": "451070", "professor_name": "Natalia Gajdamaschko", "avg_rating": 4.75, "avg_difficulty": 3.25, "review_count": 4, "reviews": [{"rating": 5.0, "difficulty": 5.0, "course_code": "EDUC879", "date": "Aug 24th, 2022", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "Yes", "Grade": "A", "Textbook": "Yes"}, "review_msg": "It was a pleasure to take her class. I found the material extremely difficult since I had training in other areas (i.e. Economics). However, she knows the content well, and it is easy to grasp after her explanations and guided discussions. She is a very rare Professor as she has a deep understanding of Marxism, politics, and philosophy in general.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 4.0, "course_code": "EDUC879", "date": "Mar 1st, 2008", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "While in Natalia's class I learned more than in any other university class. She took time, patient & enthusiasiasm to make sure we understand the material. Her goal was centered on students' best. Her passion for teaching/learning combined with her infinate knowledge on Vygotsky resulted in excellent class dynamics. A Vygotskian scholoar/teacher.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "EDUC879", "date": "Aug 2nd, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I was eager to learn about Vygotsky, and Natalia made it a pleasure - she had all of the good \"gossip.\"  I liked that she discussed most topics first, then allowed us to do the reading.  It really helped me to understand what might have been quite difficult.  I think it's a mark of how good a prof Natalia is that I found the subject so interesting!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 2.0, "course_code": "EDUC879", "date": "Jul 31st, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Although I was not excited about taking a course on Vygotsky, Natalia made the course interesting and even entertaining at times!  I learned more then I had planned to, and even ended up enjoying the class!  I would definitely recommend Natalia as a fantastic instructor to anyone!", "helpful": 0, "not_helpful": 0, "tags": []}]}]}