{"course_code": "ENG387", "total_reviews": 13, "instructors": [{"professor_id": "97577", "professor_name": "Nicole Didicher", "avg_rating": 3.75, "avg_difficulty": 3.25, "review_count": 8, "reviews": [{"rating": 3.0, "difficulty": 4.0, "course_code": "ENG387", "date": "Jan 7th, 2019", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "No", "Grade": "B+", "Textbook": "Yes"}, "review_msg": "Nicky has clearly put a lot of thought into her approach to education. She is a good teacher, though sometimes her personality comes across as bitter and condescending like someone who has been bullied throughout their life. People seem to like her. I did not. Course content was a boring disappointment. Nevertheless, she is a skilled educator.", "helpful": 0, "not_helpful": 0, "tags": ["Tough Grader", "Participation matters", "Clear grading criteria"]}, {"rating": 2.0, "difficulty": 4.0, "course_code": "ENG387", "date": "Jan 15th, 2018", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "No", "Grade": "B", "Textbook": "Yes"}, "review_msg": "Nicky was never specific about what she really wanted and she always had us guessing. I say us because I spoke with a handful of students from this class (5/18) and they agreed. Moreover, we spent more time on the various theories she brought to class than the actual texts themselves... I didn't lean anything new in this class.", "helpful": 5, "not_helpful": 1, "tags": ["Tough Grader"]}, {"rating": 5.0, "difficulty": 4.0, "course_code": "ENG387", "date": "Jul 7th, 2016", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "Yes", "Grade": "B+", "Textbook": "Yes"}, "review_msg": "Nicky is one of my favourite professors at SFU. Her unique and personalized grading scale is effective and student driven and she truly cares about helping you succeed. She is incredibly organized which makes classes go by so fast, and she has a fun side to her as well. She is a shining example of an educator and an all around great lady.", "helpful": 1, "not_helpful": 1, "tags": []}, {"rating": 4.5, "difficulty": 4.0, "course_code": "ENG387", "date": "Apr 15th, 2016", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "A", "Textbook": "Yes"}, "review_msg": "Nicky is amazing! Focused on Student-Centred learning, which was nice because you were able to pick assignments and gradings that fit your abilities and interests. Not an easy marker,  it definitely benefits to meet with her during office hours for essay/assignment prep. I've taken two classes with her and 100% would take a class with her again.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 3.0, "course_code": "ENG387", "date": "Dec 15th, 2015", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "B+", "Textbook": "Yes"}, "review_msg": "Nicky allows you to choose your grade weight which is tough, because sometimes you can choose unwisely. You also get to choose your own assignments and due dates. Nicky has very interesting lectures but it is student based so be prepared to be social. SO helpful, take advantage of office hours to figure out exactly what she's looking for. Best prof", "helpful": 1, "not_helpful": 1, "tags": []}, {"rating": 3.0, "difficulty": 3.0, "course_code": "ENG387", "date": "Dec 15th, 2015", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "This class was all student based. You get to choose your assignments, grading & readings. The problem is, that the readings don't flow nicely together, or have a common/ongoing theme. I would recommend doing the in person draft marking with Professor Didicher, as you get a clear idea of what she looks for in essays!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "ENG387", "date": "Jun 17th, 2004", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "There were too many books on the reading list but overall a great course and relatively easy because her marking system allows you to capitalize on your strengths. Nicky is extremely approachable & helpful - would definitely take another course with her.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.0, "difficulty": 2.0, "course_code": "ENG387", "date": "Mar 20th, 2004", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "I feel like I'm back in elementary school with all the juvenille group projects we've had to do.  Too many books on the reading list.  Do the exam instead of the reading journal, it's less work.  Only take this class if you really need it.", "helpful": 0, "not_helpful": 0, "tags": []}]}, {"professor_id": "887894", "professor_name": "Karyn Huenemann", "avg_rating": 3.5, "avg_difficulty": 2.4, "review_count": 5, "reviews": [{"rating": 2.5, "difficulty": 2.0, "course_code": "ENG387", "date": "Apr 5th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "She's a nice person but I didn't find this class helpful at all. Lectures frequently ran off topic and the reading list seemed totally supplementary. I didn't even bother to read the last 3. Her marking scheme is useless as well. She offers only grammatical corrections and no real feedback to help you with on your paper. I'll be avoiding her.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 3.0, "course_code": "ENG387", "date": "Apr 17th, 2010", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Karyn is a spectacular professor! She runs an interesting class with ample time for discussion. Yes, she gives writing assessments and flexible due dates. Firstly, its 3rd year, you should be able to do them no sweat. Secondly, she assigns them to HELP you do better on your Term paper. She gives ample opportunity to get top marks. Excellent prof!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 1.0, "course_code": "ENG387", "date": "Apr 15th, 2009", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "Horrible. If you like getting a good mark without doing anything/learning anything, Karyn's class is for you. The best part is you are required to do High School style writing assessments for a third year English course. I started out thinking this would be my favourite course this semester and I ended up dreading going to each useless class.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "ENG387", "date": "Feb 24th, 2009", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Karyn is a supportive professor. 387 is the second class I have taken with her. Her lecture style is mostly  informative and relevant. She willingly gives help and feedback on paper topics and papers, which I found essential for my success in 354. She is  flexible and allows students to explore genres and theoretical issues that they find interesti", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 3.0, "course_code": "ENG387", "date": "Jul 29th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I took various courses with Karyn and found them all to be interesting. She really does know her subject matter & is always willing to share what she knows with her students. Karyn may appear to obsess over grammar but in the post-secondary & professional \"real\" worlds she knows that to be taken seriously her students need to adhere to grammar.", "helpful": 0, "not_helpful": 0, "tags": []}]}]}