{"course_code": "ENGL387", "total_reviews": 19, "instructors": [{"professor_id": "1830216", "professor_name": "Broc Rossell", "avg_rating": 5.0, "avg_difficulty": 3.0, "review_count": 1, "reviews": [{"rating": 5.0, "difficulty": 3.0, "course_code": "ENGL387", "date": "Jun 2nd, 2014", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Great prof! One of my favorites at SFU and is genuinely interested in the subject and seeing his students succeed. He's very glad to help as well fun and keeps his classes/seminars interesting. I've taken more than once course with him and each time I felt I was really learning something, not just fulfilling a requirement.", "helpful": 3, "not_helpful": 7, "tags": []}]}, {"professor_id": "97577", "professor_name": "Nicole Didicher", "avg_rating": 3.11, "avg_difficulty": 3.44, "review_count": 9, "reviews": [{"rating": 2.0, "difficulty": 5.0, "course_code": "ENGL387", "date": "Dec 8th, 2018", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "No", "Grade": "", "Textbook": "Yes"}, "review_msg": "Nicky allows students to choose our assignments and the grading weight. However, she isn't clear on what she expects from you and is extremely harsh with marking. Seeing her at office hours isn't helpful either, as she can be dismissive. After a whole semester, she honestly did not teach many essential topics and lectures were useless.", "helpful": 3, "not_helpful": 0, "tags": ["Tough Grader", "Participation matters", "ACCESSIBLE OUTSIDE CLASS"]}, {"rating": 3.0, "difficulty": 3.0, "course_code": "ENGL387", "date": "Dec 20th, 2017", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "Yes", "Grade": "B-", "Textbook": "Yes"}, "review_msg": "It is an easy course compared with other English courses. You can decide your assignment component and grade weighing. Keep the grade balanced and choose assignments wisely. Nicky is a tough grader that she deducts one mark for each grammar mistake up tp ten marks in your essay. There are group works and discussions in every lecture take a long time.", "helpful": 1, "not_helpful": 0, "tags": ["Tough Grader"]}, {"rating": 3.0, "difficulty": 4.0, "course_code": "ENGL387", "date": "Jun 23rd, 2016", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "No", "Grade": "", "Textbook": "Yes"}, "review_msg": "Nicky was really insightful about the subject matter, but could be demanding about things like perfect grammer on essays. A little dry, but always willing to help out her students.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "ENGL387", "date": "Jun 14th, 2016", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "Not sure yet", "Textbook": "Yes"}, "review_msg": "Had for intersession, so there was a lot of reading condensed. She allowed us to determine were are marks go. So if you like essays and suck at participation, you can weigh your grades accordingly. She always seems available for extra help. She also incorporates a lot of student centered learning and ways for you to participate online.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "ENGL387", "date": "Mar 1st, 2015", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "For the love of god, DON'T TAKE a class with her! A literature class was turned into nothing more than another feminist preaching the feminist agenda. You WILL NOT learn anything new, I promise you that. You will be graded very unfairly. She will take 10% off papers for things never explained. You're GPA will suffer, you've been warned...", "helpful": 10, "not_helpful": 13, "tags": []}, {"rating": 1.5, "difficulty": 3.0, "course_code": "ENGL387", "date": "Jul 17th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "She's a very nice person who is willing to help students by going over outlines and drafts. However, there's a huge discrepancy between her marking scheme and what one would believe she expects given the work done during class. Lectures were 50% useless as 50% of the time she made us do group work rather than give information about the works.", "helpful": 1, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "ENGL387", "date": "Jan 12th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Nicky is creative, engaging, and particular. She very much values her students' knowledge and shapes the class to their interests. Her methods are unconventional (e.g. she does not merely lecture at the front of the class) which is a refreshing change. She is very clear about what is required for a good mark.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 1.0, "course_code": "ENGL387", "date": "Oct 30th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Nicky is engaging, knowledgeable, and approachable. However, she takes the \"student centered learning\" approach too far. A lot of students just don't know very much. I'd rather attend a lecture where I learn about literature rather than spend half the class listening to irrelevant anecdotes from other people's childhoods.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.5, "difficulty": 5.0, "course_code": "ENGL387", "date": "Apr 27th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Interesting prof with extremely unique and sometimes controversial views.  Do not take if you want an easy A because that will be next to impossible.  Tough marker, but lets you choose which assignments you want to do.  I ended up with a B+, but that was a struggle and other classes suffered for it, would not really recommend her.", "helpful": 0, "not_helpful": 0, "tags": []}]}, {"professor_id": "887894", "professor_name": "Karyn Huenemann", "avg_rating": 3.29, "avg_difficulty": 3.57, "review_count": 7, "reviews": [{"rating": 2.5, "difficulty": 4.0, "course_code": "ENGL387", "date": "May 2nd, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "I'm still trying to figure out how she marks things. It's totally arbitrary. The amount of work for this class was a bit ridiculous for a third year class, especially since we got the marking criteria for one assignment the day it was due. Plays favourites (2/68 students get full participation marks? Come on). Not horrible, but not outstanding.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.5, "difficulty": 3.0, "course_code": "ENGL387", "date": "Apr 5th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "I only read one of the assigned books, as most assignments (including the term paper) - aside from a critical review on a reading of your choice - have NOTHING to do with the course. They are totally supplementary. She's super picky about the mechanics of writing so she's a hard marker. Aside from that I thoroughly enjoyed the course.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "ENGL387", "date": "Mar 11th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "She knows her stuff. Lectures are engaging. However, kind of condescending and rude. She has her 'favorites' in the class. Questionable marking scheme. No final exam for the course, though, and for me that's a plus. I'm on the fence with her, but I wouldn't discourage you from taking the course because you will learn a lot.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 2.0, "course_code": "ENGL387", "date": "Apr 14th, 2010", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I learned so much from this class--this is one of the few profs who has helpful, useful feedback on improvement. My writing is much more coherent and correct because of this class.  Great discussions, great textual information, wonderful flexibility with interests and assignments. Yes, she doesn't baby you through the course--you're in 3rd year.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.5, "difficulty": 4.0, "course_code": "ENGL387", "date": "Jul 21st, 2008", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Disorganised: yes. Passion for subject: yes. Loves classroom discussion. Found her lectures 2B related & informative. Very insistent on correct grammar and citation, but is a 300-level class, so students should know how to write correctly anyway. Found her 2B helpful; have saved some of her handouts for future ref. I recommend her for this class!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "ENGL387", "date": "Apr 26th, 2008", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I've had profs who are scattered yet entertaining, she is just scattered. At a certain point it affects your mark, because her expectations are not clear and she is full of excuses for her lousy teaching methods. If you don't have time to put together organized, interesting lectures, don't teach! Seems kind of unfriendly too.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 4.0, "course_code": "ENGL387", "date": "Mar 19th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "If you are not technically inclined, you won't like her. But then again, you won't be reading this, either. She likes her subject matter and expects you to read it, but appreciates discussion and is open to different opinions. Beware: Your term paper outline should be a paper by itself, not a one -page suggestion, and write your bibliography first.", "helpful": 0, "not_helpful": 0, "tags": []}]}, {"professor_id": "2477542", "professor_name": "Nicky Didicher", "avg_rating": 5.0, "avg_difficulty": 3.5, "review_count": 2, "reviews": [{"rating": 5.0, "difficulty": 3.0, "course_code": "ENGL387", "date": "Feb 7th, 2022", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "Yes", "Grade": "B+", "Textbook": "Yes"}, "review_msg": "Nicky is one of the most caring and understanding profs Ive ever had. Her green sheet method makes it so you can choose how you are marked , what your assignments are worth, AND when theyre due! Amazing flexibility for the student! Visiting her office hours is key to ensure the best possible grades as her feedback (although harsh) is insightful.", "helpful": 3, "not_helpful": 0, "tags": ["Gives good feedback", "Accessible outside class", "Clear grading criteria"]}, {"rating": 5.0, "difficulty": 4.0, "course_code": "ENGL387", "date": "Nov 12th, 2020", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "B", "Textbook": "Yes"}, "review_msg": "I will never stop praising nicky, she truly cares so much about her students, and really wants you to learn. In upper division classes she usually lets you choose which assignments you want to do, how much theyre going to be worth, and when your due dates are. She's also willing to do \"live markings\" where she grades your essay/assignment beside u", "helpful": 0, "not_helpful": 0, "tags": ["Gives good feedback", "Participation matters", "Amazing lectures"]}]}]}