{"course_code": "HIST1707", "total_reviews": 6, "instructors": [{"professor_id": "1118648", "professor_name": "Neven Leddy", "avg_rating": 4.75, "avg_difficulty": 3.5, "review_count": 6, "reviews": [{"rating": 4.5, "difficulty": 3.0, "course_code": "HIST1707", "date": "May 30th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Great prof. Energetic and interesting, great speaker. Always willing to meet outside of class, even on weekends, for extra help. The workload seems daunting at first, but it's spread out over the course. Reading the textbooks are a MUST!!!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 4.0, "course_code": "HIST1707", "date": "May 3rd, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Neven was willing to meet us at Carleton, at Ottawa U, in Montreal, on the bus and in the pub (don't know if anyone ever took him up on that one)This class literally taught me more about the world (i.e. ask for Spam and potatoes in Nepal)than any other class I have ever taken or likely will take.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 3.0, "course_code": "HIST1707", "date": "May 2nd, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "AWESOME teacher. incredibly fun lectures with relevant material and stories provided to support his arguments. a veritable treasure trove of cool information. however - he will challenge you to think outside the box with your essays. Well worth it to take the class. by far the best teacher i have had at carleton. (i'm in year 4). take the class.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 3.0, "course_code": "HIST1707", "date": "Mar 30th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Neven was honestly the best prof I have encountered so far. His lectures were sooo entertaining; I looked forward to going to class every lecture.  His assignments are challenging, but you learn a lot while doing them. I switched into a double major with History after his class. I really hope to take more of his classes in my degree.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 4.0, "course_code": "HIST1707", "date": "Mar 30th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Neven in definitely one of my favourite professors at Carleton. He takes the train all the way into ottawa on a sunday afternoon just to give us help on his diabolically hard essays. Great teacher and he has awesome anecdotal little stories about his life that make coming to class a pleasure. thanksthis class would have sucked hard wihtout you", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 4.0, "course_code": "HIST1707", "date": "Mar 25th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Neven is an amazing professor.  He is very entertaining and brings the subject to life.  His lectures are always interesting.  The course itself can be very difficult at times, but Neven tries to help his students as much as possible.  Overall, great prof!", "helpful": 0, "not_helpful": 0, "tags": []}]}]}