{"course_code": "ENGL101W", "total_reviews": 6, "instructors": [{"professor_id": "1481045", "professor_name": "Niall MacKenzie", "avg_rating": 4.17, "avg_difficulty": 2.17, "review_count": 6, "reviews": [{"rating": 4.0, "difficulty": 3.0, "course_code": "ENGL101W", "date": "Feb 13th, 2014", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "C+", "Textbook": "Yes"}, "review_msg": "5 novels, 2 of them is for essay writing and 1 of the other 3 is for the final. 1st essay novel will be most interesting. the rest are boring as hell. but I d say that TA Amelia helps improving my critical thinking and writing. she is the best and most wonderful TA i ever met and I was so lucky that she was there to help improving my literacy.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 2.0, "course_code": "ENGL101W", "date": "Dec 2nd, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "At first, I didn't like the way his lectures were structured but after getting used to him (I was in his tutorial) and his lectures, he turned out to be a pretty alright prof and guy all-around. He is sarcastic, which is hilarious and very knowledgeable. Marks very fairly and gives good feedback. He gives you a lot of help if you ask. Recommend :)", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 3.0, "course_code": "ENGL101W", "date": "Nov 17th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "A-", "Textbook": "Yes"}, "review_msg": "A bit of an arrogant guy, but very well-spoken nonetheless. Niall is real smart, but I have a problem with his lack of organization. There's very little structure to his lectures, he rarely starts class on time, and he compensates by ending class late. His rambling does get tiring and boring after a while, so be prepared.", "helpful": 2, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 1.0, "course_code": "ENGL101W", "date": "Apr 11th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "This prof is amazing!  He chose such interesting books, led amazing discussion, and made some genius connections.  I cannot wait until he teaches another class I can take.  HIGHLY RECOMMEND!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 2.0, "course_code": "ENGL101W", "date": "Apr 1st, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Genius prof.  Manages to tie material into other more significant literature and introduces some useful ideas for Arts students.  He's got an amazing sense of humour and is very knowledgeable... However, if you feel he's laughing at you secretly, he probably is..", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "ENGL101W", "date": "Dec 8th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Amazing professor. Intelligent, witty, easy-going. Keeping up with reading is easy just don't be lazy. I loved this course and would absolute recommend it and any class of his. The ideal English prof. If you love English the exam/course is easy but you still learn a ton. I can't say enough good things about this prof and course.", "helpful": 0, "not_helpful": 0, "tags": []}]}]}