{"course_code": "IS240", "total_reviews": 6, "instructors": [{"professor_id": "1549914", "professor_name": "Cherlynn Bassani", "avg_rating": 2.75, "avg_difficulty": 2.33, "review_count": 6, "reviews": [{"rating": 1.5, "difficulty": 4.0, "course_code": "IS240", "date": "Dec 15th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Terrible experience. She is vague with her expectations pertaining to exams and assignments. She has spelling errors on questions which are very language sensitive. To top it off, she's passive aggressive and downright rude sometimes in her feedback to students. I've never seen a worse attitude towards students by a university professor. Appalling.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 3.0, "course_code": "IS240", "date": "Nov 21st, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "DO NOT take a class with this professor. I have never been so frustrated trying to understand course content. She is very difficult to get a hold of (e-mailed her 4 times before she responded) and responded to my questions with \"maybe you will understand once the course is done\" when I finally got an appointment with her.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 3.0, "course_code": "IS240", "date": "Nov 21st, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Do not take a class with this professor. I have never felt so frustrated trying to understand course material. She is hard to get a hold of (emailed her 4 times before I got a response) and told me \"maybe you will understand after the course is over\" instead of answering my questions. Take the course with someone else!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 2.0, "course_code": "IS240", "date": "Nov 10th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "She's very hard to get a hold of. Twice she just didn't respond to my emails at all. She's easy to understand in class but doesn't post info about projects, like what she expects & how she grades. Her test didn't ask one straightforward question. I studied & was still confused at what she was getting at. She seems nice until you ask her for help.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 1.0, "course_code": "IS240", "date": "Nov 4th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "One of the best and nicest profs I've had. She is extremely helpful and concerned about her students. No trick questions and surprises in the exams. She makes the most difficult courses seem easy and gives you a great grade. I highly recommend this course for an easy grade.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 1.0, "course_code": "IS240", "date": "Apr 28th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "She is one of the best professors I've had so far. very concerned about her students and helpful. she's not the kind of prof that tricks you with stupid questions in the exams. easy to get a good grade.", "helpful": 0, "not_helpful": 0, "tags": []}]}]}