{"course_code": "HIST235", "total_reviews": 6, "instructors": [{"professor_id": "28773", "professor_name": "Roxanne Panchasi", "avg_rating": 3.75, "avg_difficulty": 3.67, "review_count": 6, "reviews": [{"rating": 5.0, "difficulty": 4.0, "course_code": "HIST235", "date": "May 22nd, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Lots of work (surprised it wasn't a W designated course!) but Roxanne is a very good teacher. She demands a lot from her students but is by no means unreasonable. Lectures were interactive and enjoyable, she wants to help her students succeed. Would absolutely recommend taking classes with her after a nightmare history class with Pabel.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.0, "difficulty": 4.0, "course_code": "HIST235", "date": "Jul 25th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Her lectures are interesting but they don't have anything to do with what we read in the textbook. I really don't like the textbook she decided to use this semester. It's incredibly wordy, political and BORING! She gives weekly quizzes on the chapter we're to read for that week and sometimes the quizzes are super hard! Over all this class is ok.", "helpful": 1, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 4.0, "course_code": "HIST235", "date": "Nov 15th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "If she likes you, she will give you a good grade. The ones that pucker up the professor. She is clear and concise during lectures, however, during midterms she may ask you one detail she only went over once in class once. The textbook was almost of no use when it came to the tests (gives you broad info.). Horrible professor underneath a good smile", "helpful": 1, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "HIST235", "date": "Nov 6th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I love Roxanne! She was interesting, energetic and helpful. She was knowledgeable and very approachable. I found the focus on social implications very helpful because military history can be very dry! If you are looking for a prof that will be a guiding factor in your academic future, get to know Roxanne! I will look for future classes of hers!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 4.0, "course_code": "HIST235", "date": "Sep 14th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Roxanne is a fantastic prof. Can't say enough good things about her. She is helpful, energetic, interesting and interested in her students. She puts a lot in and in turn expects a lot from her students. If you put the effort in, you'll do well. As I read in someone else's posting, if you're there for an easy A you should drop out of school.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.0, "difficulty": 4.0, "course_code": "HIST235", "date": "Aug 13th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Really nice prof. and easy course to take, but her marking is kinda weird. Take her course if you think you  got perfect english. However, her lecture is fun and relaxing.", "helpful": 0, "not_helpful": 0, "tags": []}]}]}