{"course_code": "HIST472", "total_reviews": 5, "instructors": [{"professor_id": "437775", "professor_name": "Luke Clossey", "avg_rating": 4.5, "avg_difficulty": 2.6, "review_count": 5, "reviews": [{"rating": 5.0, "difficulty": 3.0, "course_code": "HIST472", "date": "Aug 20th, 2023", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "A", "Textbook": "Yes"}, "review_msg": "Dr. Clossey is a solid teacher. In seminars he lets the conversation develop mostly unguided, which is not necessarily bad. He doesn't give conclusive answers or say \"we should talk about this\", instead, he responds with questions and lets us work through it, or not depending on how the discussion shifts. I'd recommend him for history majors.", "helpful": 0, "not_helpful": 0, "tags": ["Participation matters", "Clear grading criteria", "Gives good feedback"]}, {"rating": 3.0, "difficulty": 3.0, "course_code": "HIST472", "date": "Jan 22nd, 2023", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "B+", "Textbook": "Yes"}, "review_msg": "Great prof if you are someone who can learn on their own as well as from others. Do not expect this professor to give you the answers. This applies to lower and upper div classes. He allows you freedom to create but make sure to be concise in writing. If you are sloppy in your writing you will be punished. This includes missing minor punctuation.", "helpful": 1, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 2.0, "course_code": "HIST472", "date": "Dec 21st, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "Very hipsterish prof, but also really good. Enthusiastic, conscientious, and non-judgy. Lots of comments on assignments, good class structure, and marks get progressively higher throughout the semester (because you've improved? or to give that illusion...) The class was about teaching world history so, challenging, but still worth taking.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 3.0, "course_code": "HIST472", "date": "Dec 3rd, 2005", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "He's gotta be the best prof. EVER! I looked forward to going to his classes. Yes, they are THAT interesting! He really cares about his students and tries to help them in any way he can. His courses also make you think. Take his courses! You will walk away having learned a lot.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "HIST472", "date": "Dec 3rd, 2005", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "Highly recommend taking any course Clossey offers, he is the best teacher in the HIST hands down.  As for a marker, he is definately not a hard marker, just make sure someone proof reads your work.  He's sticky about English.  Very sympathetic to students, cares about his class something you don't see up at SFU in any department.", "helpful": 0, "not_helpful": 0, "tags": []}]}]}