{"course_code": "HIST416", "total_reviews": 6, "instructors": [{"professor_id": "646622", "professor_name": "Mike Lanthier", "avg_rating": 4.67, "avg_difficulty": 2.67, "review_count": 6, "reviews": [{"rating": 5.0, "difficulty": 2.0, "course_code": "HIST416", "date": "Aug 2nd, 2017", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "", "Textbook": "Yes"}, "review_msg": "This was a really enjoyable fourth-year course.  There was almost always good energy in the room, and Doctor Lanthier struck the right balance: he let students do most of the talking , but he also put us back on the right path when we got off-track and gave us additional information and insight when it was useful.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "HIST416", "date": "Apr 4th, 2017", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "B+", "Textbook": "Yes"}, "review_msg": "Took his seminar on the French Revolution last year, and it was a lot more interesting than I though it would be.  There was good interaction in the classroom, and Dr. Lanthier really encouraged that and was willing to take a back seat.  But he still had a lot to say, and he made the French Revolution seem really relevant to the 21st century.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 4.0, "course_code": "HIST416", "date": "Aug 17th, 2016", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "A-", "Textbook": "Yes"}, "review_msg": "A prof who is extremely knowledgeable on the French Revolution, but don't let that intimidate you. He comes across like he will be a harsh marker but is actually quite fair.  There is quite a bit of reading, but he facilitates conversation well which makes it easy for you to participate and earn those extra marks", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 3.0, "course_code": "HIST416", "date": "Apr 11th, 2016", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I took HIST 416 three (four?) summers ago, and it was a really good class.  I thought that it was demanding and involved a lot of reading at the time, and it kind of stressed me out because I was working 40 h/w.  But I got a lot out of it, and I really liked the way he connected the French Revolution to modern events + big philosophical problems.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "HIST416", "date": "Jul 30th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "French Revolution - Passionate about subject, expects lots of discussion, very clear with his expectations on assignments. Doesn't expect perfection on style formatting for papers. Classes were interesting. Expected students to have more background knowledge although there was no prereq except 60credits.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.5, "difficulty": 3.0, "course_code": "HIST416", "date": "Jan 4th, 2006", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "He made the class very interesting and it was a nice change from the usual lecture setting of history classes.  However he did not hand back many marks until the very end, leaving most students very worried about their standing until the very end!  Overall a great, enthouiastic teacher who is still interested in teaching and helping his students.", "helpful": 0, "not_helpful": 0, "tags": []}]}]}