{"course_code": "CRIM355", "total_reviews": 42, "instructors": [{"professor_id": "59555", "professor_name": "Gail Anderson", "avg_rating": 3.25, "avg_difficulty": 3.4, "review_count": 42, "reviews": [{"rating": 3.0, "difficulty": 4.0, "course_code": "CRIM355", "date": "Dec 11th, 2024", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "A-", "Textbook": "Yes"}, "review_msg": "lectures, readings, quizzes and assignments were all good/reflected the content. Good lecturer and knowledgeable. graded harshly without any feedback. The final was stressful, not enough time to complete, lengthy answers needed. it was open book, be prepared to know your stuff because you will not have time to look for in depth answers.", "helpful": 0, "not_helpful": 0, "tags": ["Tough grader"]}, {"rating": 2.0, "difficulty": 4.0, "course_code": "CRIM355", "date": "Dec 7th, 2024", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "A-", "Textbook": "Yes"}, "review_msg": "Each week had lecture videos (1hr+ long) and weekly quizzes that were ok (sometimes very specific and other times very easy). The TAs mark kinda hard; sometimes arbitrarily deducting marks as they expect very specific things without clarifying it. Final exam was STRESSFUL- so much writing. While it was open book, it was hard bc of the detailed Qs.", "helpful": 0, "not_helpful": 0, "tags": ["Tough grader", "Get ready to read", "Lecture heavy"]}, {"rating": 2.0, "difficulty": 3.0, "course_code": "CRIM355", "date": "Dec 6th, 2024", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "Anderson's weekly lectures are quite lengthy and contain a lot of information which was very time consuming. The assignments and quizzes aren't too bad, however the written part of the final was quite hard and long. She expects multi paragraph answers to so many questions under a time constraint. Prepare for lots of writing in this class.", "helpful": 0, "not_helpful": 0, "tags": ["Tough grader", "Get ready to read"]}, {"rating": 4.0, "difficulty": 3.0, "course_code": "CRIM355", "date": "Jan 2nd, 2021", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "A", "Textbook": "Yes"}, "review_msg": "Adjusted class so you can choose when you want to do summary & critical thinking assignments (really helped, avoid overlapping with other courses). Quizzes worth 40% tested details from lecture/textbook (make sure to take good notes). TAs and Gail were always fair and very accessible for help throughout the semester.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "CRIM355", "date": "Nov 18th, 2020", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "B+", "Textbook": "Yes"}, "review_msg": "This class has quizzes every week but if you listen to the lectures you will be okay on those. There is a discussion every week as well. 4 critical assignment but you can choose what week you want and you also have to do one summary in the whole sem. The class was super interesting and Gail is a great prof.", "helpful": 0, "not_helpful": 0, "tags": ["Participation matters", "Clear grading criteria", "Amazing lectures"]}, {"rating": 2.0, "difficulty": 4.0, "course_code": "CRIM355", "date": "Aug 7th, 2020", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "No", "Grade": "Not sure yet", "Textbook": "Yes"}, "review_msg": "Didn't give any reviews for exams and they were worth majority of grade.. exams were mc but poorly timed and super hard questions. Also, they mark discussions out of 10, but give no feedback on how to improve. You basically got to teach yourself everything and know the textbook inside out for exams. Even the paper had no proper outline or feedback", "helpful": 0, "not_helpful": 0, "tags": ["Get ready to read", "Graded by few things", "Test heavy"]}, {"rating": 3.0, "difficulty": 5.0, "course_code": "CRIM355", "date": "Apr 24th, 2019", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "No", "Grade": "A-", "Textbook": "Yes"}, "review_msg": "The final exam is ridiculously hard... I did really well on the midterm and paper but the final exam dropped my grade (40% of grade). There is nothing that will prepare you for the detailed and irrelevant questions that have nothing to do with the big picture.", "helpful": 1, "not_helpful": 1, "tags": ["Test heavy", "Tough grader"]}, {"rating": 3.0, "difficulty": 5.0, "course_code": "CRIM355", "date": "Apr 21st, 2018", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "No", "Grade": "Not sure yet", "Textbook": "Yes"}, "review_msg": "Interesting class, but the amount of work that must be done to prep for the exams is ridiculous. You can study the textbook material and lectures, but she will still ask questions that come as a surprise to you. Exam was fair, but final was brutal. From a person who did exceptionally well on the midterm and paper, the final was very disappointing!", "helpful": 2, "not_helpful": 1, "tags": ["Tough Grader", "Get ready to read", "TEST HEAVY"]}, {"rating": 5.0, "difficulty": 5.0, "course_code": "CRIM355", "date": "Dec 10th, 2017", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "", "Textbook": "Yes"}, "review_msg": "Gail is such an underrated prof. Her lectures are very interesting and definitely keeps you on your toes. This is a fun course as she mentioned but it is also very hard. There is so much content covered throughout the semester. It's best to relisten to lecture recordings when studying and to make flashcards. She loves to test on lists.", "helpful": 1, "not_helpful": 1, "tags": ["Tough Grader", "Get ready to read", "Amazing lectures"]}, {"rating": 4.0, "difficulty": 4.0, "course_code": "CRIM355", "date": "Apr 26th, 2017", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "No", "Grade": "A-", "Textbook": "Yes"}, "review_msg": "Gail truly knows her stuff and you will learn a lot from her; however, she is very strict on marking guidelines and is very specific. You will have to know intricate details, albeit, most are emphasized in lecture. Would recommend if you're interested in forensics, but its not an easy A.", "helpful": 1, "not_helpful": 0, "tags": ["Tough Grader", "Respected", "GRADED BY FEW THINGS"]}, {"rating": 3.5, "difficulty": 4.0, "course_code": "CRIM355", "date": "Apr 19th, 2016", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I took this class online and thought it was great. However, the exams were difficult. She wants you remember all the little details. We were given modules (which helped understand the chapter better) and the textbook (which you had to read). Overall, if you put effort into this course it shouldn't be too bad. The paper was not that difficult.", "helpful": 2, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 4.0, "course_code": "CRIM355", "date": "Apr 12th, 2016", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "", "Grade": "B-", "Textbook": "Yes"}, "review_msg": "Gail is amazing, honestly it is a privilege to take a class with such an accomplished person. She is so sweet and down to earth, and what she has done career wise is seriously inspirational. Lectures are very interesting, tests are a little tough so get ready to read the textbook. I have taken several of her classes and I never cease to be amazed!", "helpful": 0, "not_helpful": 3, "tags": []}, {"rating": 4.5, "difficulty": 3.0, "course_code": "CRIM355", "date": "Jan 2nd, 2016", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "A", "Textbook": "Yes"}, "review_msg": "Gail is one of the most intelligent profs I've ever had. This class is extremely FAIR. Print out notes and bring to class to add to them, attend each lecture and tutorial. Do not stress over the textbook details, focus on her lecture notes when you study. MT was super doable and fair, the paper was easy and the final was pretty fair. Put in work.", "helpful": 1, "not_helpful": 0, "tags": []}, {"rating": 2.0, "difficulty": 3.0, "course_code": "CRIM355", "date": "Dec 4th, 2014", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I think the in class version is way easier, they give you all the answers to the tests before but if you do it online you will never find them. The tests are useless, major concepts are ignored and small details that you would find pointless to study are on the exam! The assignments were a joke, 5 minutes max per week, easy marking on paper.", "helpful": 2, "not_helpful": 0, "tags": []}, {"rating": 3.0, "difficulty": 5.0, "course_code": "CRIM355", "date": "Dec 14th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "The class is NOT easy. Even if you come to every lecture and read the textbook, the exams are very hard. The questions are really specific and random. Probably won't get higher than a C unless you read the textbook every week.", "helpful": 0, "not_helpful": 3, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "CRIM355", "date": "Aug 18th, 2013", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "B", "Textbook": "Yes"}, "review_msg": "took CRIM 355 online, material is not hard to learn but there is A LOT TO KNOW. you have to literally know every tiny detail in the textbook. exams are extremely detailed. momo as the TA marks so hard, but she also marks pretty easy on the paper and participation. still, this is a stressful class. avg on exams were 61% and 70%. not recommended", "helpful": 2, "not_helpful": 2, "tags": []}, {"rating": 3.0, "difficulty": 5.0, "course_code": "CRIM355", "date": "Apr 30th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Very interesting course. Gail is extremely knowledgeable and knows the material inside out. However, she expects the same from students for the exams. Exams are very difficult - marking is incredibly specific. Definitely not a GPA booster.", "helpful": 0, "not_helpful": 1, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "CRIM355", "date": "Apr 30th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "Reads off her lecture slides, while TAs focus on important parts of the lecture. However, her exams are not reflective of the material.I scored well above average on the paper and the midterm but the final was an absolute mystery.NOT A GPA BOOSTER", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "CRIM355", "date": "Apr 29th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "NOT a GPA booster. Exams are hard. Tutorials are useless.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "CRIM355", "date": "Apr 29th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Despite learning a lot from the class and Gail being very knowledgable, I do not understand how this course was set up. The exams were unreasonable. The tutorials (not mandatory but should be for mark booster), where the TAs even gave us hints, did NOT help. Too much emphasis on tests that are impossible.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 2.0, "course_code": "CRIM355", "date": "Apr 4th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "This was one of my favourite classes I took in my undergrad. Gail has so much experience in the field, she has a passion for forensic sciences and knows what she is talking about. Every lecture was so interesting and she could always talk about her own experiences on the job. Excellent prof!", "helpful": 2, "not_helpful": 1, "tags": []}, {"rating": 2.0, "difficulty": 5.0, "course_code": "CRIM355", "date": "Dec 24th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "Class was interesting, but exams were horrible. The final exam consisted of over 10 pages on short answers only. The short answers were usually 2-4 marks each also. Tutorials were pretty much useless.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "CRIM355", "date": "Dec 22nd, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "cannot stress enough how backwards the exams are. maybe its because gail is from the UK.  you can study your brains out and know everything in lecture in side and out and I guarantee you, you will not get a high grade..questions - easy. her marking.... the TA follows a SET answer sheet, deviate from it, you're screwed.  class avg C+ .... wow", "helpful": 0, "not_helpful": 1, "tags": []}, {"rating": 2.5, "difficulty": 4.0, "course_code": "CRIM355", "date": "Dec 20th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "How to put this class in words? I got 3 A's this semester and got 93% on the term paper for 355, but because of her exam marking, got a B overall.  Do not take this class for a GPA booster.  Exams were the most ambiguous I've ever had at SFU and a poor reflection of course material.  That being said, she is knowledgable,textbook is very interesting", "helpful": 1, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "CRIM355", "date": "Dec 5th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "The course material was very interesting and I enjoyed Gail's lectures. Marking for the exam was very picky so be sure to memorize the textbooks. Tutorials for the most part were useless. Gail also had her lectures recorded so that was a bonus as I could re-listen to them in the car ride up.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 3.0, "course_code": "CRIM355", "date": "Apr 20th, 2012", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Overall, great course. I think Gail is really funny actually. Read the textbook, go to lecture, and you're golden.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 4.0, "course_code": "CRIM355", "date": "Dec 24th, 2011", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Straight forward class, 2 exams and a paper. Lectures were mildly entertaining, tutorials were utterly useless. Exams are hard, mainly because the questions are quite random. Lecture notes are hardly tested on, mainly focused on the textbook and literally everything in it. Quite the memorize everything and anything type of course.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.5, "difficulty": 4.0, "course_code": "CRIM355", "date": "Dec 22nd, 2010", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "The class got boring fast. Gail's lecture notes were lengthy and were too much to study for. Textbook was certainly mandatory as she had quite a few questions from it. Exams were cumulative and they were long and tedious. Her expectation was quite high for the exams. If you love memorizing materials this class is good to take. Otherwise avoid it.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 1.0, "course_code": "CRIM355", "date": "Apr 2nd, 2009", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "This was the first class I have taken with Gail and she is awesome! He exams are very fair, as long as you study you will be fine. The paper was a bit tricky. TA's are both pretty nice and are helpful. Would take another class with her. Learned a lot of cool stuff from the lectures and guest speakers were good too!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 3.0, "course_code": "CRIM355", "date": "Dec 2nd, 2008", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "EXTREMELY boring class. Don't take it if you don't need it. Topic sounded interesting at first...but by the end you learn to hate it. It's so repetitive, I fell asleep every lecture. Tutorials are useless.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "CRIM355", "date": "May 19th, 2008", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "definately recommended! great class. great prof! gail is extremely helpful. exams are pretty easy.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 1.0, "course_code": "CRIM355", "date": "Apr 17th, 2008", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "Gail told really great anecdotes. The class could have been much more interesting in terms of content. Also, all the lectures are online so it's hard to stay awake in lecture. There's only one 10-page paper, midterm, and final so it's a pretty easy elective compared to other crim classes, especially if you have a full course load.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "CRIM355", "date": "Apr 25th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Forensic science is very interesting. But if you do not like memorizing then do not take this course. You have to memorize most of the concepts for the midterm and final. Gail was a good prof..I don't think that she is \"stuck up\". She's actually pretty cool. Go to lecture and memorize the material and you'll do well.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.5, "difficulty": 2.0, "course_code": "CRIM355", "date": "Jan 4th, 2006", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "Decent prof & class. Although Gail is very knowledgeable about the material, it tends to be dry and boring. However, she does provide some interesting real life example. Perhaps, a smaller and more interactive class would be helpful. Tutorials are pointless. Exams cover the main concepts, and is not too difficult. Class:6.5/10 Professor: 7/10", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "CRIM355", "date": "Dec 8th, 2005", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "Absolutely love everything about this class! Enjoyed her teaching style a lot and very well organized. She had guest speakers come in to talk to our class about their specialization in the field. She gets an A for sure. She'd get an A+ if we got to do more hands-on experiments and interactive tutorials.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 1.0, "course_code": "CRIM355", "date": "Jul 13th, 2004", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "AWESOME", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 3.0, "course_code": "CRIM355", "date": "Jul 2nd, 2004", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "get over yourself!!!!  you are full of yourself!!!!  if you could do that, maybe you would be a good teacher!!  absolutley arrogant and has NO idea how to teach!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 2.0, "course_code": "CRIM355", "date": "May 14th, 2004", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "very interesting class & well organized lectures. she prints out her notes for students. exams are all about memorization. study off her notes & you should do well.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 3.0, "course_code": "CRIM355", "date": "May 5th, 2004", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "Wonderful prof! Interesting classes and she's totally approachable. Dedicated to teaching; she's not just there to keep tenure (way too many of those types around here).", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 2.0, "course_code": "CRIM355", "date": "Aug 13th, 2003", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "She's too much into herself.  Forensic science is quite interesting but stop tooting your own horn!", "helpful": 0, "not_helpful": 1, "tags": []}, {"rating": 3.5, "difficulty": 3.0, "course_code": "CRIM355", "date": "Apr 10th, 2003", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "No Comments", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 1.0, "course_code": "CRIM355", "date": "Nov 12th, 2002", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "A-", "Textbook": ""}, "review_msg": "must take!!", "helpful": 0, "not_helpful": 0, "tags": []}]}]}