{"course_code": "BISC300", "total_reviews": 59, "instructors": [{"professor_id": "2315421", "professor_name": "Jayme Lewthwaite", "avg_rating": 3.0, "avg_difficulty": 3.0, "review_count": 1, "reviews": [{"rating": 3.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Dec 8th, 2017", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "No", "Grade": "Not sure yet", "Textbook": "Yes"}, "review_msg": "Super sweet and very willing to answer questions. A lot of the quizzes were very picky, and there was way too much material on the second midterm. Slides can be a little confusing and she's not the most emotive speaker but she's okay.", "helpful": 0, "not_helpful": 0, "tags": ["TEST HEAVY", "Caring", "Tests are tough"]}]}, {"professor_id": "1442425", "professor_name": "Nicole Tunbridge", "avg_rating": 4.75, "avg_difficulty": 2.5, "review_count": 2, "reviews": [{"rating": 5.0, "difficulty": 2.0, "course_code": "BISC300", "date": "Aug 5th, 2014", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "A", "Textbook": "No"}, "review_msg": "Nicole is amazing. Had her for BISC204 as well. Never any surprises on her exams and doesn't just test memorized facts, she wants you to apply it to other situations. Didn't use the textbook at all. Just her notes are enough to get you through with a good grade.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 3.0, "course_code": "BISC300", "date": "Jan 1st, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Dr. Tunbridge is really enthusiastic about the material and genuinely interested in helping students - answered a ton of my questions on a late night right before the exam! One of the things I really appreciated was that she references classic papers from literature and also keeps students informed of volunteering opportunities in the department.", "helpful": 1, "not_helpful": 0, "tags": []}]}, {"professor_id": "1842954", "professor_name": "Alex Chubaty", "avg_rating": 1.91, "avg_difficulty": 4.47, "review_count": 34, "reviews": [{"rating": 3.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Jan 9th, 2014", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I might get flamed for this but I thought the course was decent. My big advice was to read the textbook!!! I barely studied his lecture notes and did well on the exams. I recommend understanding concepts plus memorizing since he asked both types of questions on the tests. Evolution has some very abstract concepts so do not cram last minute.", "helpful": 1, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 16th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "This is the worst class with the worst prof I have ever taken. Exams, assignments, and tutorials are not coordinated at all. No one is of any help and all they tell you is to read the textbook. I do not understand how he was chosen to be a prof for this class", "helpful": 1, "not_helpful": 1, "tags": []}, {"rating": 2.0, "difficulty": 4.0, "course_code": "BISC300", "date": "Dec 16th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "I don't believe in bad mouthing a professor unless they are horrendous, so I will instead give advice. Read the textbook religiously, page to page. Practice the supplementary \"problems\" he provides with no end. Force him in class (by asking questions in advance) to keep the class going, as it often repeats. Or do not take this class.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 16th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "This was probably the worst class I have ever taken. The course material was pretty straightforward, however the exams were totally left field and were more theory based. On top of that, his teaching wasn't the greatest, and tutorials and assignments did not correlate. I totally regret taking the course with him, try to take it with someone else...", "helpful": 0, "not_helpful": 1, "tags": []}, {"rating": 2.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 11th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Overall he is a \"fair\" prof, not the best, not the worst. His questions made you apply concepts learned, which are excellent, if only he actually taught the concepts well. Heavy use of textbook readings, and class/tutorials do little to explain the readings in a better manner. Overall, good guy, bad class.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 4.0, "course_code": "BISC300", "date": "Dec 11th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "Not_Sure_Yet", "Textbook": "Yes"}, "review_msg": "While I think that Alex was actually good at explaining concepts, he was AWFUL at writing questions. No idea what he wanted half the time. And just telling people to read an entire textbook was not helpful at all. TA's also didn't help much. He's a nice guy though and has a good sense of humour.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Dec 10th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "People really seemed to dislike him, but I've had FAR worse profs in university. He tried to make things interesting. I rather liked his class. His class has more applied questions vs. pure memorization which a lot of people HIGHLY disliked, but it seemed to work for me. Hated that he gave a 2 pg research essay worth 3% like one week before finals.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 10th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "Not_Sure_Yet", "Textbook": "No"}, "review_msg": "He is a nice guy, but unfortunately didn't take the time to structure the class. The notes have little to do with the textbook and the textbook has little to do with the class. All his questions were really open ended and marked extremely hard. T.A's could have been replaced with a Santa decoration: useless. Unable to answer basic questions. AVOID!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 4.0, "course_code": "BISC300", "date": "Dec 10th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Nice guy, bad prof. Exams are all application type questions, but his lectures are summaries of the text and mostly conceptual. Isn't clear with what he wants, and not entirely fair with marking. I didn't try as hard in this class as I should have, but he was no help. I'll probably end up retaking with a better prof.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 10th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "He is bad at explaining and his questions are confusing. He does not communicate with his TAs so they have no idea what is going on. When you ask for clarification of questions they don't even understand the questions he makes up himself. Notes are completely useless, filled with pictures and doesn't cover main concepts from the book.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 10th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "C-", "Textbook": "Yes"}, "review_msg": "As Frank Costanza once said, \"This guy... this is not my kind of guy.\"", "helpful": 1, "not_helpful": 2, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 10th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "B-", "Textbook": "Yes"}, "review_msg": "Alex really knows his stuff and he seems really passionate about the material. Unfortunately, he's not a good prof. The tutorials and lectures did little to prepare me for exams. I felt like I was studying in the dark when it came to exam time. The tutorials were pointless and lectures tended to be rather vague. Try to avoid this prof if possible", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 4.0, "course_code": "BISC300", "date": "Dec 10th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Alex is a great guy; He is very approachable, and acts kindly to his students. Sadly, his course is questionable at best. In example, one entire tutorial (50min) was spent explaining Phylogenetic tree formation; we were never examined on this. You'll spend hours reading, and class won't ever help to explain what you read before hand. Do not take.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 9th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Quick list of 'problem areas': Under explained concepts. Over explained details. Baren class notes. Misleading exam questions. Little feedback via marking (doesn't explain mark distribution). Poor use of time in tutorials. Last minute or poorly thought out assignments. Exhaustive use of textbook. Intended target audience: PhD students.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 9th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "There is only one problem with this prof. It is not that his class is extremely watered down. Its not that his exams are very concentrated. Its not that his tutorials are pointless. It's that he's a brand new professor. Sure he should have had a year of PDP, but it seems like his target audience is PhD, not 2nd/3rd year students.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 8th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "Not_Sure_Yet", "Textbook": "No"}, "review_msg": "Nice guy & obviously really smart, but he doesn't explain things well & seems to forget we're not all as smart as he is. Needs to be able to simplify his explanations and be a little more clear. Wouldn't recommend taking a class with him right now, but he does have potential to be a great prof. Threw a lot of entertaining material in there for us.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 4.0, "course_code": "BISC300", "date": "Dec 8th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Would not recommend. His lecture notes are very broad, exams are very detailed. He says read the textbook, but most of the textbook is material that is irrelevant to the course material. Tutorials were useless. I had a great TA, but we did nothing except for quizzes and read papers when we could've been going over concepts. No exam review, nothing.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 7th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "Fail", "Textbook": "Yes"}, "review_msg": "Should have been an online course, all he does is tell you to go read the book. Not that it helps..", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 6th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "Not_Sure_Yet", "Textbook": "No"}, "review_msg": "When it comes down to it, he can't teach. He doesn't go into ANY kind of detail and just expects us to understand everything hes not saying. The textbook is useless and unrelated. Both the texts and lectures are filled with information we're not tested on and the information we do need is no where to be found. 50% average is his fault, NOT OURS.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 6th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "C-", "Textbook": "Yes"}, "review_msg": "He's a pretty bad prof. His lectures are fairly round-about. He tends to skim over topics vaguely, but then expects very specific answers on exams. The average for both midterm exams were right around 50%. Honestly, the best part of this course was filling out the prof evaluation forms.", "helpful": 1, "not_helpful": 1, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 5th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "Not_Sure_Yet", "Textbook": "No"}, "review_msg": "He is the worst professor I have had yet at SFU. Lectures are not informative and his exams are not fair at all. The only advice he ever gives is read the textbook. I have been reading the textbook and his exam is not relevant. He should reflect on the fact that the class average is so low, and that it is likely not the students' fault but his own.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 4th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "C-", "Textbook": "Yes"}, "review_msg": "hate to say this cause he's such a nice guy and really knowledgeable about the course.. but he is awful at teaching. Quiz and exam questions were vague and unclear and he expected very specific and detailed answers. The average for both midterms was around 50, which is extremely low for bisc300.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "BISC300", "date": "Dec 4th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "Not_Sure_Yet", "Textbook": "Yes"}, "review_msg": "I'm not here to bad mouth the guy, but he was a pretty awful prof. He does seem like a generally nice guy, but not much of a teacher. Purple-monkey-dishwasher (for any Simpsons fans who need cheering up :)", "helpful": 1, "not_helpful": 1, "tags": []}, {"rating": 1.5, "difficulty": 3.0, "course_code": "BISC300", "date": "Nov 30th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Need more ability to explain the concepts. USELESS TUTORIALS the only good part was to have weekly quizzes at the beginning of tutorials rest of it was a waste of time. Should have discussed and solved questions relevant to the exams in the tutorial. Also,one of the TAs didn't know the course well.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Nov 27th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "\"A naive professor\" can best describe Chubaty. He has little experience with teaching. Class time was spent explaining pictures rather than concepts. Tutorial time was spent vaguely explaining concepts rather than applying them. Midterms were somewhat fair. He gave no indication as to what you got right or wrong on each question (Arbitrary mark)", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 4.0, "course_code": "BISC300", "date": "Nov 25th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "He is a brand new 'sessional' professor and it shows. Class is concept based whereas the exams and assignments were applications of the concepts. There was no previous practice with applying concepts as class ended up being a textbook summary and tutorials ended up being largely useless. AVOID until the class structure improves.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 5.0, "course_code": "BISC300", "date": "Nov 25th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Overall he can clearly talk and you can see he enjoys it. Unfortunately he cannot structure the class. Assignments were paced randomly. Midterms were ridiculous and he uses an excuse to say students dont answer questions to say that an avg was over 50 instead of saying it was way below because it was unfair. Ridiculous 10 markQ on 32 or 36 mark MT", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "BISC300", "date": "Nov 25th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "If you are a mind reader, then this class should be easy. Then again, if you're a mind reader, any class should be easy. The prof is extremely vague and the tutorials were just a way to keep students in one place an hour a week. Try to avoid this prof if possible, or be a psychic. Either or", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.0, "difficulty": 4.0, "course_code": "BISC300", "date": "Nov 24th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Chubaty has to potential teach. However the way class is structured is very poor. The class is a summary of the textbook. Tutorials do not apply concepts, but rather recite them. You should be dedicated to reading the book and studying attentively, otherwise this class will become overwhelming very quickly.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.5, "difficulty": 5.0, "course_code": "BISC300", "date": "Nov 20th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "B", "Textbook": "No"}, "review_msg": "If you could avoid this prof, do it! He is terrible at explaining. His lectures are useless and very brief. His exams are harshly marked and the questions are extremely ambiguous. You just can't study for them cause he doesn't say what he expects us to know. One exam question was a random graph. His TA's were also useless. Worst course ever!", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 4.0, "course_code": "BISC300", "date": "Oct 29th, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Takes forever to get to the point and sometimes doesn't even get to the point. His lecture slides are all pictures and he just talks in round about explanations. Midterm was very hard considering the average was ~50% for a bio class. Gave an assignment 5 days before midterm 1, now giving another assignment week of midterm 2.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.0, "difficulty": 4.0, "course_code": "BISC300", "date": "Oct 28th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "His lectures are educational and entertaining, but expects students to \"read his mind\" about what he wants as answers on assignments -- if you want a diagram, SAY SO. The midterm was not representative of the material emphasized in class, tutorials, or even the midterm review.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 2.5, "difficulty": 4.0, "course_code": "BISC300", "date": "Oct 23rd, 2013", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "It's really hard to judge what could be on his exams. Sometimes an obscure experiment from the textbook ends up being a 4 mark question on an exam that's out of 32 marks. Things he emphasized didn't make it onto the midterm yet things we barely covered were on there. Not a bad guy though, and he tries to make lectures interesting", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Oct 18th, 2013", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "He's pretty cute and he makes class interesting.", "helpful": 0, "not_helpful": 0, "tags": []}]}, {"professor_id": "2414946", "professor_name": "Birgit Schwarz", "avg_rating": 2.5, "avg_difficulty": 3.0, "review_count": 2, "reviews": [{"rating": 4.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Nov 30th, 2018", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "Yes", "Grade": "", "Textbook": "No"}, "review_msg": "Good course, learned a lot. Overall would take again.", "helpful": 0, "not_helpful": 12, "tags": ["Participation matters", "Caring", "GROUP PROJECTS"]}, {"rating": 1.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Nov 27th, 2018", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "No", "Grade": "", "Textbook": "No"}, "review_msg": "Spent too much time on assignments in class (ended up being a month behind in material). Mumbled and was very unclear. Group work on exams took away from time on individual mark which took away from my grade overall. Tutorial mark was annoying to receive (not based on attendance only). Didnt fix mic when talking so there was constant feedback.", "helpful": 20, "not_helpful": 0, "tags": ["Participation matters"]}]}, {"professor_id": "1868919", "professor_name": "Mikael Mokkonen", "avg_rating": 2.75, "avg_difficulty": 2.5, "review_count": 4, "reviews": [{"rating": 2.0, "difficulty": 2.0, "course_code": "BISC300", "date": "Jul 28th, 2020", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "No", "Grade": "A", "Textbook": "No"}, "review_msg": "Mika was a great person and was accommodating during online classes due to COVID; however, I found his lecturing poor as it sounded like he was just going off a script. I also thought the assignments given in this class were unnecessary and didn't give proper opportunity to show what you learned. Tests were fair. Good person, poorly designed class.", "helpful": 0, "not_helpful": 0, "tags": ["Respected", "Group projects", "Lecture heavy"]}, {"rating": 4.0, "difficulty": 2.0, "course_code": "BISC300", "date": "Aug 2nd, 2019", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "Not sure yet", "Textbook": "Yes"}, "review_msg": "Although lecture slides weren't always the most clear, lectures themselves were decent and exams were fair. Mika does a good job of explaining concepts and pointing out particularly important information, and the course content itself is quite interesting. Definitely a solid prof.", "helpful": 1, "not_helpful": 0, "tags": ["Get ready to read", "Skip class? You won't pass.", "Group projects"]}, {"rating": 1.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Jun 5th, 2019", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "No", "Grade": "Not sure yet", "Textbook": "No"}, "review_msg": "He doesnt seem to know what hes talking about. He reads off the lecture slides (which I doubt was made by him) and he still has a hard time getting the main points across. It feels like a high school kid is attempting to teach a university level course by skimming through the textbook once. Do not recommend this prof.", "helpful": 0, "not_helpful": 1, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Dec 8th, 2017", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "Not sure yet", "Textbook": "Yes"}, "review_msg": "Pretty clear as far as lecturers go, and the slides were more or less self explanatory. The quizzes were okay, if a little picky. His final straight from the slides. Nice guy.", "helpful": 0, "not_helpful": 0, "tags": ["Participation matters", "TEST HEAVY"]}]}, {"professor_id": "780484", "professor_name": "Erin Barley", "avg_rating": 3.6, "avg_difficulty": 2.8, "review_count": 5, "reviews": [{"rating": 1.5, "difficulty": 4.0, "course_code": "BISC300", "date": "Aug 30th, 2010", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Worst professor ever. You may find the lectures easy and they are, however when it comes to exam time she focuses on tiny detail that she did not cover for more than 5 seconds. She does not record her lectures and does not use the microphone, so they are mandatory to attend. She is unorganized and puts lectures up very late.", "helpful": 1, "not_helpful": 0, "tags": []}, {"rating": 4.5, "difficulty": 3.0, "course_code": "BISC300", "date": "Aug 13th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Very good prof. Interested in the subject and very lively at lectures. Always happy to see student during office hours. Can explain details very well and answer questions very well.", "helpful": 0, "not_helpful": 1, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "BISC300", "date": "Jul 26th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "GREAT prof! she knows her stuff and can communicate that knowledge in lectures really well. midterm was easy if you study her notes and refer to txtbook if anything unclear. and great attitude to studens! had her for bisc102 lab, she was good instructor for that too", "helpful": 0, "not_helpful": 1, "tags": []}, {"rating": 4.0, "difficulty": 1.0, "course_code": "BISC300", "date": "Mar 25th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "awesome prof", "helpful": 0, "not_helpful": 1, "tags": []}, {"rating": 3.0, "difficulty": 4.0, "course_code": "BISC300", "date": "Sep 4th, 2006", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Relatively unprepared for lecture.  Extremely boring.  Tends to ask ridiculously hard questions on exams.  Definately hit up Renaissance before lecture.", "helpful": 1, "not_helpful": 0, "tags": []}]}, {"professor_id": "371990", "professor_name": "David Green", "avg_rating": 4.5, "avg_difficulty": 3.0, "review_count": 3, "reviews": [{"rating": 5.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Dec 27th, 2005", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "Clear, extremely helpful when asked (staying well beyond his hours) - and worked hard to be entertaining in Lecture.  Good sense of humour. He helped me recover from an F on the first midterm to a B+ in the course.  One of the top BIO teachers I have encountered, though he doesn't give grades for free. Great teaching - has my respect and gratitude.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Dec 13th, 2005", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "really funny, interesting..sometimes his tests can be tricky because there aren't much examples in the lecture nots to go by, but he will do anything that he can in order to help you do will in the class. I got a C+ on the first midterm, but recovered for an A in the class at the end....very helpful", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 3.5, "difficulty": 3.0, "course_code": "BISC300", "date": "Dec 6th, 2005", "metadata": {"For Credit": "", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "I've learned alot from this class.  I would name him at his origin as a \"pretty interesting guy\"...then he evolved into a \"pretty boring, rambling bloke\"...I JUST wish he went extinct at the end, or perhaps he shouldve been selected against, or maybe someone should've given him adrenaline shots at the beginning of each class.", "helpful": 0, "not_helpful": 0, "tags": []}]}, {"professor_id": "42895", "professor_name": "Rolf Mathewes", "avg_rating": 2.9, "avg_difficulty": 3.2, "review_count": 5, "reviews": [{"rating": 3.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Mar 19th, 2025", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "", "Grade": "Not sure yet", "Textbook": "Yes"}, "review_msg": "Rolf needs to recognize that we're in 2025, not 2000. Students don't attend lectures just to sit through dry and monotonous slide presentations. It's time to move beyond a one-way lecture format!", "helpful": 0, "not_helpful": 0, "tags": ["Lecture heavy", "Test heavy"]}, {"rating": 1.0, "difficulty": 4.0, "course_code": "BISC300", "date": "Feb 26th, 2025", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": ""}, "review_msg": "does not curve when exam grades average low, is extremely rude, tells people not to ask questions during the exam and then laughs in their face when they need a question reworded. i've never heard of such a tone-deaf rude prof before who just does not care about students in any way.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Sep 6th, 2023", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "Yes", "Grade": "A", "Textbook": "Yes"}, "review_msg": "Rolf was actually a pretty good professor. As he's been teaching for a long time he has a routine, but is clearly passionate about the material and biology itself. He is fairly clear by what are the most important takeaways from the lecture notes (usually bolded or emphasized in some way), but the long answers on the exams can be a little vague.", "helpful": 0, "not_helpful": 0, "tags": ["Get ready to read", "Test heavy", "Graded by few things"]}, {"rating": 3.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Jun 5th, 2017", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "Yes", "Grade": "", "Textbook": "Yes"}, "review_msg": "-tests are fair, study the book (he asks quest from practise chapter quest) & lots of def / short answer type on midterms -approachable and helpful", "helpful": 0, "not_helpful": 2, "tags": ["Respected", "Clear grading criteria", "Amazing lectures"]}, {"rating": 3.5, "difficulty": 3.0, "course_code": "BISC300", "date": "Mar 20th, 2015", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "You can REALLY tell he loves what he does. If you're not interested in the course material, it'll suck, but if you are into it, his lectures are FULL of interesting facts and details, which are helpful even if not directly examinable. Course was well-organised and easy to understand. Lots of info, but no trick questions.", "helpful": 8, "not_helpful": 5, "tags": []}]}, {"professor_id": "947206", "professor_name": "Jana Vamosi", "avg_rating": 3.33, "avg_difficulty": 3.33, "review_count": 3, "reviews": [{"rating": 1.0, "difficulty": 5.0, "course_code": "BISC300", "date": "Apr 2nd, 2008", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "Yawn", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 4.0, "difficulty": 3.0, "course_code": "BISC300", "date": "Jul 29th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "No"}, "review_msg": "Great lady. A young, modern & fun. prof that tries to make the class interesting. She's patient & her exams are fair.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 2.0, "course_code": "BISC300", "date": "Apr 12th, 2007", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "Good, easy course. Don't need textbook, just follow her notes and you'll do good. Basic mt's, not tricky questions or anything like that.", "helpful": 0, "not_helpful": 0, "tags": []}]}]}