{"course_code": "WL300", "total_reviews": 5, "instructors": [{"professor_id": "1305780", "professor_name": "Azadeh Yamini-Hamedani", "avg_rating": 2.5, "avg_difficulty": 3.0, "review_count": 5, "reviews": [{"rating": 1.0, "difficulty": 3.0, "course_code": "WL300", "date": "Jul 5th, 2025", "metadata": {"For Credit": "Yes", "Attendance": "Not Mandatory", "Would Take Again": "", "Grade": "B", "Textbook": "N/A"}, "review_msg": "She just rants every class. Often times she will say one thing in one lecture and another thing in another lecture giving conflicting information. Gets pissed off when asked to clarify. I have learned nothing at all in this class. It's just adult daycare, for both us and her. There is no value here, only busywork. I deeply regret taking this course", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 1.0, "difficulty": 3.0, "course_code": "WL300", "date": "Jun 26th, 2025", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "", "Grade": "C", "Textbook": "N/A"}, "review_msg": "Azadeh is the most unprofessional professor I've had. She is consistently unprepared. Feels like she's just making it up as she goes. Often times I wonder if she's intoxicated during lectures. She is combative, catty and bitter and should quit but won't because the bar is so low and the pay is good. All I learned is that lit courses are a circus.", "helpful": 0, "not_helpful": 0, "tags": []}, {"rating": 5.0, "difficulty": 3.0, "course_code": "WL300", "date": "Oct 26th, 2016", "metadata": {"For Credit": "Yes", "Attendance": "", "Would Take Again": "Yes", "Grade": "", "Textbook": "Yes"}, "review_msg": "She is the example of what a true Professor is like! You learn so much from her and if she knows that you are actually working hard and participating in discussions because you want to get something from the class, she will be there for you. She was always available for help outside of the class and her office hours are productive.", "helpful": 1, "not_helpful": 4, "tags": ["Gives good feedback", "Inspirational", "Amazing lectures"]}, {"rating": 1.0, "difficulty": 5.0, "course_code": "WL300", "date": "Jul 5th, 2016", "metadata": {"For Credit": "Yes", "Attendance": "Mandatory", "Would Take Again": "No", "Grade": "B+", "Textbook": "Yes"}, "review_msg": "This class is a requirement for a World Literature major. You forced to take this class with this instructor. I would suggest waiting as long as possible before taking it. The instructor's discussion is painful tangential. The class is too difficult for what it actually is.", "helpful": 7, "not_helpful": 2, "tags": []}, {"rating": 4.5, "difficulty": 1.0, "course_code": "WL300", "date": "Mar 17th, 2010", "metadata": {"For Credit": "", "Attendance": "", "Would Take Again": "", "Grade": "", "Textbook": "Yes"}, "review_msg": "One of the best (if not the best) Professors I've ever had. I've taken multiple courses with her and she is just amazing. Cares about her students, wants everyone to do well and is extremely helpful. She's all about her students! If only all teachers could be like her! Don't think twice about enrolling in her class...just do it!", "helpful": 3, "not_helpful": 4, "tags": []}]}]}